---
kind: property
id: P:Autodesk.Revit.DB.ExternalResourceBrowserData.FolderPath
source: html/3a4e2d9e-41a8-380e-46b1-ab000c4b6a60.htm
---
# Autodesk.Revit.DB.ExternalResourceBrowserData.FolderPath Property

The current folder path to which the new resources and subfolder belong.

## Syntax (C#)
```csharp
public string FolderPath { get; }
```